---
kind: enumMember
id: F:Autodesk.Revit.DB.StorageType.ElementId
enum: Autodesk.Revit.DB.StorageType
source: html/3dbebcb8-792b-a3dd-fe63-faaa05704f3c.htm
---
# Autodesk.Revit.DB.StorageType.ElementId

The data type represents an element and is stored as the id of the element.